Enums/ЭтапыМаршрутаПациента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ЭтапыМаршрутаПациента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Консультация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДиагностикаЛабораторная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДиагностикаИнструментальная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Лечение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДинамическийКонтроль</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СтандартыЛечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СтандартыЛечения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлДокумента</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширениеФайлаДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стоматологический</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтандарта</Name>
					<Comment>Истина - регламентированный, Ложь - внутренний</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОфициальное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучноеРедактирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРегламентированногоСтандарта</Name>
					<Comment>1 - Первичная медико-санитарная помощь, 2 - Специализированная медицинская помощь</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолПациента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозрастнаяКатегория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВозрастныеКатегории</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтадияЗаболевания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименованиеСтандарта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Назначения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СправочникМеждународныхНепатентованныхНаименований</v8:Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНазначения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыНазначений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядковыйНомер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СмещениеОтДатыПриема</Name>
							<Comment>Смещение даты назначения в днях относительно даты документа "Прием", в котором выбран данный шаблон плана лечения.</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодставитьВрачаИзПриема</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторНазначения</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазоваяДоза</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриемовВДень</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураМедицинскихУслуг</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураМедицинскихУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Частота</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтапМаршрутаПациента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЭтапыМаршрутаПациента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/ВыборУслугСтандартаЛечения/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартЛечения = Параметры.СтандартЛечения;
	
	Если Не ЗначениеЗаполнено(СтандартЛечения) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Заголовок = "Выбор услуг стандарта: " + СтандартЛечения;
	ЗаполнитьДеревоУслуг();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Для Каждого СтрокаЭтапа Из Услуги.ПолучитьЭлементы() Цикл
		Элементы.Услуги.Развернуть(СтрокаЭтапа.ПолучитьИдентификатор());
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДеревоУслуг()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Стандарт", СтандартЛечения);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Назначения.ЭтапМаршрутаПациента КАК Этап,
	|	Назначения.Назначение КАК Назначение,
	|	Назначения.Количество КАК Количество,
	|	Назначения.ИдентификаторНазначения КАК ИдентификаторНазначения,
	|	Назначения.ПорядковыйНомер КАК ПорядковыйНомер,
	|	ВЫБОР
	|		КОГДА Назначения.ЭтапМаршрутаПациента = ЗНАЧЕНИЕ(Перечисление.ЭтапыМаршрутаПациента.Консультация)
	|			ТОГДА 1
	|		КОГДА Назначения.ЭтапМаршрутаПациента = ЗНАЧЕНИЕ(Перечисление.ЭтапыМаршрутаПациента.ДиагностикаЛабораторная)
	|			ТОГДА 2
	|		КОГДА Назначения.ЭтапМаршрутаПациента = ЗНАЧЕНИЕ(Перечисление.ЭтапыМаршрутаПациента.ДиагностикаИнструментальная)
	|			ТОГДА 3
	|		КОГДА Назначения.ЭтапМаршрутаПациента = ЗНАЧЕНИЕ(Перечисление.ЭтапыМаршрутаПациента.Лечение)
	|			ТОГДА 4
	|		КОГДА Назначения.ЭтапМаршрутаПациента = ЗНАЧЕНИЕ(Перечисление.ЭтапыМаршрутаПациента.ДинамическийКонтроль)
	|			ТОГДА 5
	|		ИНАЧЕ 99
	|	КОНЕЦ КАК ПорядокЭтапа
	|ИЗ
	|	Справочник.СтандартыЛечения.Назначения КАК Назначения
	|ГДЕ
	|	Назначения.Ссылка = &Стандарт
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокЭтапа,
	|	ПорядковыйНомер";
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДеревоУслуг = РеквизитФормыВЗначение("Услуги", Тип("ДеревоЗначений"));
	ДеревоУслуг.Строки.Очистить();
	СтрокиЭтапов = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаЭтапа = СтрокиЭтапов.Получить(Выборка.Этап);
		Если СтрокаЭтапа = Неопределено Тогда
			СтрокаЭтапа = ДеревоУслуг.Строки.Добавить();
			СтрокаЭтапа.ЭтоГруппа = Истина;
			СтрокаЭтапа.Этап = Выборка.Этап;
			СтрокаЭтапа.Пометка = Истина;
			СтрокаЭтапа.Представление = ?(ЗначениеЗаполнено(Выборка.Этап), Строка(Выборка.Этап), "Без этапа");
			СтрокиЭтапов.Вставить(Выборка.Этап, СтрокаЭтапа);
		КонецЕсли;
		
		СтрокаУслуги = СтрокаЭтапа.Строки.Добавить();
		СтрокаУслуги.ЭтоГруппа = Ложь;
		СтрокаУслуги.Этап = Выборка.Этап;
		СтрокаУслуги.Пометка = Истина;
		СтрокаУслуги.Представление = Строка(Выборка.Назначение);
		СтрокаУслуги.Количество = Выборка.Количество;
		СтрокаУслуги.ИдентификаторНазначения = Строка(Выборка.ИдентификаторНазначения);
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоУслуг, "Услуги");
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ЭтоГруппа Тогда
		Для Каждого СтрокаУслуги Из ТекущиеДанные.ПолучитьЭлементы() Цикл
			СтрокаУслуги.Пометка = ТекущиеДанные.Пометка;
		КонецЦикла;
	Иначе
		Родитель = ТекущиеДанные.ПолучитьРодителя();
		Если Родитель <> Неопределено Тогда
			ВсеОтмечены = Истина;
			Для Каждого СтрокаУслуги Из Родитель.ПолучитьЭлементы() Цикл
				Если Не СтрокаУслуги.Пометка Тогда
					ВсеОтмечены = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Родитель.Пометка = ВсеОтмечены;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуВсем(Пометка)
	
	Для Каждого СтрокаЭтапа Из Услуги.ПолучитьЭлементы() Цикл
		СтрокаЭтапа.Пометка = Пометка;
		Для Каждого СтрокаУслуги Из СтрокаЭтапа.ПолучитьЭлементы() Цикл
			СтрокаУслуги.Пометка = Пометка;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	УстановитьПометкуВсем(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	УстановитьПометкуВсем(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьУслуги(Команда)
	
	ВыбранныеИдентификаторы = Новый Массив;
	Для Каждого СтрокаЭтапа Из Услуги.ПолучитьЭлементы() Цикл
		Для Каждого СтрокаУслуги Из СтрокаЭтапа.ПолучитьЭлементы() Цикл
			Если СтрокаУслуги.Пометка Тогда
				ВыбранныеИдентификаторы.Добавить(СтрокаУслуги.ИдентификаторНазначения);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если ВыбранныеИдентификаторы.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Не отмечено ни одной услуги.");
		Возврат;
	КонецЕсли;
	
	Закрыть(ВыбранныеИдентификаторы);
	
КонецПроцедуры

#КонецОбласти
